export interface AssessmentOption {
  id: string;
  text: string;
  group: string;
}
export interface AssessmentCategory {
  id: string;
  title: string;
  groups: { id: string; title: string }[];
  options: AssessmentOption[];
}
export const assessment: AssessmentCategory[] = [
  {
    id: '0',
    title: '標的行為問題',
    groups: [],
    options: [
      {
        id: 'chkbox-0-0',
        text: '自傷行為',
        group: '',
      },
      {
        id: 'chkbox-0-1',
        text: '攻擊行為',
        group: '',
      },
      {
        id: 'chkbox-0-2',
        text: '固著行為',
        group: '',
      },
      {
        id: 'chkbox-0-3',
        text: '不適當的社會行為',
        group: '',
      },
      {
        id: 'chkbox-0-4',
        text: '特殊情緒困擾',
        group: '',
      },
      {
        id: 'chkbox-0-5',
        text: '身體調節異常',
        group: '',
      },
    ],
  },
  {
    id: '1',
    title: '立即前事（近因）',
    groups: [
      {
        id: 't11',
        title: '出現個案想要獲取外在刺激之事件或狀況',
      },
      {
        id: 't12',
        title: '出現個案想要避開外在刺激之事件或狀況',
      },
      {
        id: 't13',
        title: '出現個案想要獲取內在感官刺激之事件或狀況',
      },
      {
        id: 't14',
        title: '出現個案想要避開內在不舒服狀態之事件或狀況',
      },
    ],
    options: [
      {
        id: 'chkbox-1-0-t11',
        text: '想要的食物出現，抑或在特定／一段時間未獲得食物',
        group: '出現個案想要獲取外在刺激之事件或狀況',
      },
      {
        id: 'chkbox-1-1-t11',
        text: '想要的物品出現，抑或在特定／一段時間未獲得某樣物品',
        group: '出現個案想要獲取外在刺激之事件或狀況',
      },
      {
        id: 'chkbox-1-2-t11',
        text: '想要的活動出現，抑或在特定／一段時間未從事活動',
        group: '出現個案想要獲取外在刺激之事件或狀況',
      },
      {
        id: 'chkbox-1-3-t11',
        text: '想見到的某個人出現，抑或在特定／一段時間未獲得關愛、注意',
        group: '出現個案想要獲取外在刺激之事件或狀況',
      },
      {
        id: 'chkbox-1-4-t11',
        text: '參與或完成課程、活動，或做工作／作業時遭遇困難',
        group: '出現個案想要獲取外在刺激之事件或狀況',
      },
      {
        id: 'chkbox-1-5-t11',
        text: '周遭人（例如：同儕）拒絕與個案互動或讓他參與活動',
        group: '出現個案想要獲取外在刺激之事件或狀況',
      },
      {
        id: 'chkbox-1-6-t11',
        text: '在特定事物上周遭人直接幫個案做決策，抑或個案想要控制的人事物等情境出現',
        group: '出現個案想要獲取外在刺激之事件或狀況',
      },
      {
        id: 'chkbox-1-7-t11',
        text: '周遭人（例如：同儕）表現標的行為問題得以獲取個案想要的外在刺激，以讓他模仿',
        group: '出現個案想要獲取外在刺激之事件或狀況',
      },
      {
        id: 'chkbox-1-8-t12',
        text: '不想要的食物出現',
        group: '出現個案想要避開外在刺激之事件或狀況',
      },
      {
        id: 'chkbox-1-9-t12',
        text: '不想要的物品出現',
        group: '出現個案想要避開外在刺激之事件或狀況',
      },
      {
        id: 'chkbox-1-10-t12',
        text: '不想聽到的聲音出現',
        group: '出現個案想要避開外在刺激之事件或狀況',
      },
      {
        id: 'chkbox-1-11-t12',
        text: '不想見到的某個人出現',
        group: '出現個案想要避開外在刺激之事件或狀況',
      },
      {
        id: 'chkbox-1-12-t12',
        text: '他人（例如：同儕）表現不符合期待的語言或行為',
        group: '出現個案想要避開外在刺激之事件或狀況',
      },
      {
        id: 'chkbox-1-13-t12',
        text: '處於不舒服或陌生的某個地點或情境',
        group: '出現個案想要避開外在刺激之事件或狀況',
      },
      {
        id: 'chkbox-1-14-t12',
        text: '被詢問、指正、責罵或處罰',
        group: '出現個案想要避開外在刺激之事件或狀況',
      },
      {
        id: 'chkbox-1-15-t12',
        text: '被要求參與或完成不想從事的課程、活動，或工作／作業',
        group: '出現個案想要避開外在刺激之事件或狀況',
      },
      {
        id: 'chkbox-1-16-t12',
        text: '個案的物品被拿走',
        group: '出現個案想要避開外在刺激之事件或狀況',
      },
      {
        id: 'chkbox-1-17-t12',
        text: '個案的身體或物品被觸碰',
        group: '出現個案想要避開外在刺激之事件或狀況',
      },
      {
        id: 'chkbox-1-18-t12',
        text: '預定的作息改變',
        group: '出現個案想要避開外在刺激之事件或狀況',
      },
      {
        id: 'chkbox-1-19-t12',
        text: '個案被要求中止他目前正進行的活動',
        group: '出現個案想要避開外在刺激之事件或狀況',
      },
      {
        id: 'chkbox-1-20-t12',
        text: '個案的座位／空間被更動或侵犯',
        group: '出現個案想要避開外在刺激之事件或狀況',
      },
      {
        id: 'chkbox-1-21-t12',
        text: '個案被嘲弄',
        group: '出現個案想要避開外在刺激之事件或狀況',
      },
      {
        id: 'chkbox-1-22-t12',
        text: '周遭人（例如：同儕）表現標的行為問題得以避開個案不想要的外在刺激，以讓他模仿',
        group: '出現個案想要避開外在刺激之事件或狀況',
      },
      {
        id: 'chkbox-1-23-t13',
        text: '在獨處情境中無所事事、等待或從事一項活動太久，或是一段時間未獲得活動；抑或個案想要的感官刺激出現',
        group: '出現個案想要獲取內在感官刺激之事件或狀況',
      },
      {
        id: 'chkbox-1-24-t13',
        text: '個案想要的感官刺激出現，或是正在做某個他想要進行的事情或活動',
        group: '出現個案想要獲取內在感官刺激之事件或狀況',
      },
      {
        id: 'chkbox-1-25-t14',
        text: '在獨處情境中，個案處於身體欠佳（例如：尿急、飢餓）的狀態',
        group: '出現個案想要避開內在不舒服狀態之事件或狀況',
      },
      {
        id: 'chkbox-1-26-t14',
        text: '在獨處情境中，個案處於心理困頓（例如：焦慮、緊張）的狀態',
        group: '出現個案想要避開內在不舒服狀態之事件或狀況',
      },
    ],
  },
  {
    id: '2',
    title: '環境背景因素（遠因）',
    groups: [
      {
        id: 't21',
        title: '物理因素',
      },
      {
        id: 't22',
        title: '社會因素',
      },
    ],
    options: [
      {
        id: 'chkbox-2-0-t21',
        text: '天氣轉變',
        group: '物理因素',
      },
      {
        id: 'chkbox-2-1-t21',
        text: '環境空間擁擠',
        group: '物理因素',
      },
      {
        id: 'chkbox-2-2-t21',
        text: '環境照明不佳',
        group: '物理因素',
      },
      {
        id: 'chkbox-2-3-t21',
        text: '環境通風不好',
        group: '物理因素',
      },
      {
        id: 'chkbox-2-4-t21',
        text: '環境色彩不良',
        group: '物理因素',
      },
      {
        id: 'chkbox-2-5-t21',
        text: '環境動線不順',
        group: '物理因素',
      },
      {
        id: 'chkbox-2-6-t21',
        text: '環境吵雜和有干擾刺激',
        group: '物理因素',
      },
      {
        id: 'chkbox-2-7-t21',
        text: '不易取得環境中的物品',
        group: '物理因素',
      },
      {
        id: 'chkbox-2-8-t22',
        text: '在家裡發生讓個案情緒波動的事件',
        group: '社會因素',
      },
      {
        id: 'chkbox-2-9-t22',
        text: '從家裡到下一個環境（學校、機構或職場）的途中發生讓個案情緒波動的事件',
        group: '社會因素',
      },
      {
        id: 'chkbox-2-10-t22',
        text: '環境（學校、機構或職場）中發生讓個案情緒波動的事件',
        group: '社會因素',
      },
      {
        id: 'chkbox-2-11-t22',
        text: '環境中的人員產生改變',
        group: '社會因素',
      },
      {
        id: 'chkbox-2-12-t22',
        text: '受到教師或服務人員、同儕抑或家人的排斥',
        group: '社會因素',
      },
      {
        id: 'chkbox-2-13-t22',
        text: '環境未提供個案參與活動或獲得關注的機會',
        group: '社會因素',
      },
      {
        id: 'chkbox-2-14-t22',
        text: '環境未提供個案選擇或決定的機會',
        group: '社會因素',
      },
      {
        id: 'chkbox-2-15-t22',
        text: '個案在群體中的社會角色低落',
        group: '社會因素',
      },
      {
        id: 'chkbox-2-16-t22',
        text: '個案在群體中的社會關係疏離',
        group: '社會因素',
      },
      {
        id: 'chkbox-2-17-t22',
        text: '作息過於緊湊，比平常匆忙或趕時間',
        group: '社會因素',
      },
      {
        id: 'chkbox-2-18-t22',
        text: '個案正準備轉銜至新環境（新班級、學校、機構或職場），新環境的人員不了解個案的狀況',
        group: '社會因素',
      },
    ],
  },
  {
    id: '3',
    title: '個體背景因素',
    groups: [],
    options: [
      {
        id: 'chkbox-3-0',
        text: '氣質的影響：活動量、趨避性、適應度、規律性、反應閾、反應強度、堅持度、注意分散度和情緒本質等因素的影響',
        group: '',
      },
      {
        id: 'chkbox-3-1',
        text: '生理的問題：腦神經生物化學傳導物質失衡，腦神經系統異常，遺傳和染色體異常，器官發展不健全，疾病、藥物和疼痛的影響，新陳代謝／內分泌異常，飲食失衡、睡眠異常、運動不適足等生活作息的失調等的問題',
        group: '',
      },
      {
        id: 'chkbox-3-2',
        text: '能力的限制：溝通能力、認知能力、社會能力、休閒能力、因應能力、容忍能力等的限制',
        group: '',
      },
      {
        id: 'chkbox-3-3',
        text: '思考的扭曲：出現錯誤歸因的狀況，具有非理性信念、負向內言或自發性負面思考，自我效能低落',
        group: '',
      },
      {
        id: 'chkbox-3-4',
        text: '高度動機的需求未獲滿足：生理需求、安全需求、愛與隸屬需求、尊重需求、求知和尋求理解需求、審美、自我實現需求、超越需求未獲滿足',
        group: '',
      },
      {
        id: 'chkbox-3-5',
        text: '情緒狀態不佳或不穩：之前發生一些事件讓個案情緒狀態不佳（例如：憤怒、難過、焦慮、恐懼，之前發生一些事件讓個案情緒狀態不穩（例如：過於高興）',
        group: '',
      },
    ],
  },
  {
    id: '4',
    title: '標的行為問題得到之後果',
    groups: [
      {
        id: 't41',
        title: '個案獲取他想要的外在刺激，或看到表現行為問題之他人獲取他想要的外在刺激',
      },
      {
        id: 't42',
        title: '個案避開他不想要之外在刺激，或看到表現行為問題之他人避開他不想要的外在刺激',
      },
      {
        id: 't43',
        title: '個案獲取他想要之內在感官刺激，產生感官自娛的狀態',
      },
      {
        id: 't44',
        title: '個案避開他不想要之內在不舒服的狀態',
      },
      {
        id: 't45',
        title: '個案或周遭人（例如：同儕）無法由標的行為問題獲取或逃避外在／內在刺激',
      },
    ],
    options: [
      {
        id: 'chkbox-4-0-t41',
        text: '個案得到想要的食物',
        group: '個案獲取他想要的外在刺激，或看到表現行為問題之他人獲取他想要的外在刺激',
      },
      {
        id: 'chkbox-4-1-t41',
        text: '個案得到想要的物品',
        group: '個案獲取他想要的外在刺激，或看到表現行為問題之他人獲取他想要的外在刺激',
      },
      {
        id: 'chkbox-4-2-t41',
        text: '個案得到想要的活動',
        group: '個案獲取他想要的外在刺激，或看到表現行為問題之他人獲取他想要的外在刺激',
      },
      {
        id: 'chkbox-4-3-t41',
        text: '個案得到關愛、注意',
        group: '個案獲取他想要的外在刺激，或看到表現行為問題之他人獲取他想要的外在刺激',
      },
      {
        id: 'chkbox-4-4-t41',
        text: '個案得到協助',
        group: '個案獲取他想要的外在刺激，或看到表現行為問題之他人獲取他想要的外在刺激',
      },
      {
        id: 'chkbox-4-5-t41',
        text: '個案得到隸屬感和聯盟關係',
        group: '個案獲取他想要的外在刺激，或看到表現行為問題之他人獲取他想要的外在刺激',
      },
      {
        id: 'chkbox-4-6-t41',
        text: '個案獲得對外在環境的控制權',
        group: '個案獲取他想要的外在刺激，或看到表現行為問題之他人獲取他想要的外在刺激',
      },
      {
        id: 'chkbox-4-7-t41',
        text: '個案看到表現行為問題之他人獲得他想要的外在刺激',
        group: '個案獲取他想要的外在刺激，或看到表現行為問題之他人獲取他想要的外在刺激',
      },
      {
        id: 'chkbox-4-8-t42',
        text: '不想要的食物被拿走',
        group: '個案避開他不想要之外在刺激，或看到表現行為問題之他人避開他不想要的外在刺激',
      },
      {
        id: 'chkbox-4-9-t42',
        text: '不想要的物品被拿走',
        group: '個案避開他不想要之外在刺激，或看到表現行為問題之他人避開他不想要的外在刺激',
      },
      {
        id: 'chkbox-4-10-t42',
        text: '不想聽到的聲音停止',
        group: '個案避開他不想要之外在刺激，或看到表現行為問題之他人避開他不想要的外在刺激',
      },
      {
        id: 'chkbox-4-11-t42',
        text: '不想見到的人走開',
        group: '個案避開他不想要之外在刺激，或看到表現行為問題之他人避開他不想要的外在刺激',
      },
      {
        id: 'chkbox-4-12-t42',
        text: '他人（例如：同儕）不符合個案期待的語言或行為停止',
        group: '個案避開他不想要之外在刺激，或看到表現行為問題之他人避開他不想要的外在刺激',
      },
      {
        id: 'chkbox-4-13-t42',
        text: '離開令個案感到不舒服或陌生的地點或情境',
        group: '個案避開他不想要之外在刺激，或看到表現行為問題之他人避開他不想要的外在刺激',
      },
      {
        id: 'chkbox-4-14-t42',
        text: '中止對個案的詢問、指正、責罵或處罰',
        group: '個案避開他不想要之外在刺激，或看到表現行為問題之他人避開他不想要的外在刺激',
      },
      {
        id: 'chkbox-4-15-t42',
        text: '中止對個案的課程、活動，或工作／作業要求',
        group: '個案避開他不想要之外在刺激，或看到表現行為問題之他人避開他不想要的外在刺激',
      },
      {
        id: 'chkbox-4-16-t42',
        text: '個案的物品被歸還',
        group: '個案避開他不想要之外在刺激，或看到表現行為問題之他人避開他不想要的外在刺激',
      },
      {
        id: 'chkbox-4-17-t42',
        text: '中止對個案身體或物品的觸碰',
        group: '個案避開他不想要之外在刺激，或看到表現行為問題之他人避開他不想要的外在刺激',
      },
      {
        id: 'chkbox-4-18-t42',
        text: '讓個案逃避作息改變的狀況',
        group: '個案避開他不想要之外在刺激，或看到表現行為問題之他人避開他不想要的外在刺激',
      },
      {
        id: 'chkbox-4-19-t42',
        text: '撤消要個案中止活動的指令',
        group: '個案避開他不想要之外在刺激，或看到表現行為問題之他人避開他不想要的外在刺激',
      },
      {
        id: 'chkbox-4-20-t42',
        text: '停止對個案座位／空間的更動或侵犯',
        group: '個案避開他不想要之外在刺激，或看到表現行為問題之他人避開他不想要的外在刺激',
      },
      {
        id: 'chkbox-4-21-t42',
        text: '中止對個案的嘲弄',
        group: '個案避開他不想要之外在刺激，或看到表現行為問題之他人避開他不想要的外在刺激',
      },
      {
        id: 'chkbox-4-22-t42',
        text: '個案看到表現行為問題之他人逃避他不想要的外在刺激',
        group: '個案避開他不想要之外在刺激，或看到表現行為問題之他人避開他不想要的外在刺激',
      },
      {
        id: 'chkbox-4-23-t43',
        text: '個案減輕無聊感，表現愉悅的表情',
        group: '個案獲取他想要之內在感官刺激，產生感官自娛的狀態',
      },
      {
        id: 'chkbox-4-24-t43',
        text: '個案獲得想要的內在感官刺激',
        group: '個案獲取他想要之內在感官刺激，產生感官自娛的狀態',
      },
      {
        id: 'chkbox-4-25-t44',
        text: '個案減輕身體的不舒服感',
        group: '個案避開他不想要之內在不舒服的狀態',
      },
      {
        id: 'chkbox-4-26-t44',
        text: '個案減輕心理的困頓感',
        group: '個案避開他不想要之內在不舒服的狀態',
      },
      {
        id: 'chkbox-4-27-t45',
        text: '個案不受理會，抑或得不到他想要的外在刺激',
        group: '個案或周遭人（例如：同儕）無法由標的行為問題獲取或逃避外在／內在刺激',
      },
      {
        id: 'chkbox-4-28-t45',
        text: '個案不受理會，抑或無法逃避他不想要的外在刺激',
        group: '個案或周遭人（例如：同儕）無法由標的行為問題獲取或逃避外在／內在刺激',
      },
      {
        id: 'chkbox-4-29-t45',
        text: '個案受到制止、斥責、警告或處罰',
        group: '個案或周遭人（例如：同儕）無法由標的行為問題獲取或逃避外在／內在刺激',
      },
      {
        id: 'chkbox-4-30-t45',
        text: '與個案協商或做約定',
        group: '個案或周遭人（例如：同儕）無法由標的行為問題獲取或逃避外在／內在刺激',
      },
      {
        id: 'chkbox-4-31-t45',
        text: '引導個案表現適當的行為，以獲得他想要的外在刺激',
        group: '個案或周遭人（例如：同儕）無法由標的行為問題獲取或逃避外在／內在刺激',
      },
      {
        id: 'chkbox-4-32-t45',
        text: '引導個案表現適當的行為，以逃避他不想要的外在刺激',
        group: '個案或周遭人（例如：同儕）無法由標的行為問題獲取或逃避外在／內在刺激',
      },
      {
        id: 'chkbox-4-33-t45',
        text: '轉移個案的注意力，引導他做其他事情或活動，以紓解他的無聊感或不舒服狀態',
        group: '個案或周遭人（例如：同儕）無法由標的行為問題獲取或逃避外在／內在刺激',
      },
      {
        id: 'chkbox-4-34-t45',
        text: '周遭人（例如：同儕）無法由標的行為問題獲取或逃避外在刺激',
        group: '個案或周遭人（例如：同儕）無法由標的行為問題獲取或逃避外在／內在刺激',
      },
    ],
  },
  {
    id: '5',
    title: '標的行為問題之功能',
    groups: [
      {
        id: 't51',
        title: '取得外在刺激',
      },
      {
        id: 't52',
        title: '逃避外在刺激',
      },
      {
        id: 't53',
        title: '取得內在刺激',
      },
      {
        id: 't54',
        title: '逃避內在刺激',
      },
    ],
    options: [
      {
        id: 'chkbox-5-0-t51',
        text: '獲得想要的食物',
        group: '取得外在刺激',
      },
      {
        id: 'chkbox-5-1-t51',
        text: '獲得想要的物品',
        group: '取得外在刺激',
      },
      {
        id: 'chkbox-5-2-t51',
        text: '獲得想要的活動',
        group: '取得外在刺激',
      },
      {
        id: 'chkbox-5-3-t51',
        text: '獲得關愛、注意',
        group: '取得外在刺激',
      },
      {
        id: 'chkbox-5-4-t51',
        text: '獲得協助',
        group: '取得外在刺激',
      },
      {
        id: 'chkbox-5-5-t51',
        text: '獲得隸屬感和聯盟關係',
        group: '取得外在刺激',
      },
      {
        id: 'chkbox-5-6-t51',
        text: '獲得對外在環境的控制權',
        group: '取得外在刺激',
      },
      {
        id: 'chkbox-5-7-t52',
        text: '逃避不想要的食物',
        group: '逃避外在刺激',
      },
      {
        id: 'chkbox-5-8-t52',
        text: '逃避不想要的物品',
        group: '逃避外在刺激',
      },
      {
        id: 'chkbox-5-9-t52',
        text: '逃避不想聽到的聲音',
        group: '逃避外在刺激',
      },
      {
        id: 'chkbox-5-10-t52',
        text: '逃避不想見到的人',
        group: '逃避外在刺激',
      },
      {
        id: 'chkbox-5-11-t52',
        text: '逃避他人（例如：同儕）不符合期待的語言或行為',
        group: '逃避外在刺激',
      },
      {
        id: 'chkbox-5-12-t52',
        text: '逃避不舒服或陌生的地點或情境',
        group: '逃避外在刺激',
      },
      {
        id: 'chkbox-5-13-t52',
        text: '逃避詢問、指正、責罵或處罰',
        group: '逃避外在刺激',
      },
      {
        id: 'chkbox-5-14-t52',
        text: '逃避課程、活動，或工作／作業要求',
        group: '逃避外在刺激',
      },
      {
        id: 'chkbox-5-15-t52',
        text: '逃避個案的物品被拿走',
        group: '逃避外在刺激',
      },
      {
        id: 'chkbox-5-16-t52',
        text: '逃避個案的身體或物品被觸碰',
        group: '逃避外在刺激',
      },
      {
        id: 'chkbox-5-17-t52',
        text: '逃避作息的改變',
        group: '逃避外在刺激',
      },
      {
        id: 'chkbox-5-18-t52',
        text: '逃避活動的中止',
        group: '逃避外在刺激',
      },
      {
        id: 'chkbox-5-19-t52',
        text: '逃避座位／空間的更動或侵犯',
        group: '逃避外在刺激',
      },
      {
        id: 'chkbox-5-20-t52',
        text: '逃避嘲弄',
        group: '逃避外在刺激',
      },
      {
        id: 'chkbox-5-21-t53',
        text: '獲得視覺自娛刺激',
        group: '取得內在刺激',
      },
      {
        id: 'chkbox-5-22-t53',
        text: '獲得聴覺自娛刺激',
        group: '取得內在刺激',
      },
      {
        id: 'chkbox-5-23-t53',
        text: '獲得觸覺自娛',
        group: '取得內在刺激',
      },
      {
        id: 'chkbox-5-24-t53',
        text: '獲得嗅覺自娛刺激',
        group: '取得內在刺激',
      },
      {
        id: 'chkbox-5-25-t53',
        text: '獲得身體動覺自娛刺激',
        group: '取得內在刺激',
      },
      {
        id: 'chkbox-5-26-t53',
        text: '獲得口腔覺自娛刺激',
        group: '取得內在刺激',
      },
      {
        id: 'chkbox-5-27-t54',
        text: '逃避身體欠佳的狀態',
        group: '逃避內在刺激',
      },
      {
        id: 'chkbox-5-28-t54',
        text: '逃避心理困頓的狀態',
        group: '逃避內在刺激',
      },
    ],
  },
];
